n=int(input('число '))
0<=n<=1000
if n in (11,12,13,14,111,112,113,114,211,212,213,214,311,312,313,314,411,412,413,414,511,512,513,514,611,612,613,614,711,712,713,714,811,812,813,814,911,912,913,914):
    print(n, 'программистов')
elif n%10==1:
    print(n, 'программист')
elif n%10==2:
    print(n, 'программиста')
elif n%10==3:
    print(n, 'программиста')
elif n%10==4:
    print(n, 'программиста')
elif n%10==0:
    print(n, 'программистов')
elif n%10==5:
    print(n, 'программистов')
elif n%10==6:
    print(n, 'программистов')
elif n%10==7:
    print(n, 'программистов')
elif n%10==8:
    print(n, 'программистов')
elif n%10==9:
    print(n, 'программистов')


